#pragma once

#include <stdint.h>

// ******************************************************************
// ‘ункци€: целочисленное деление с округлением в большую сторону
// (без защиты от нулевого делител€).
// ******************************************************************
// ¬озвращает uint32_t целочисленное частное, округлЄнное в большую сторону.
// ******************************************************************
uint32_t MATH_DivisionCeiling(uint32_t divides, uint32_t divisor);

uint16_t MATH_CRC7_SD(uint8_t *buff, uint16_t len);
uint16_t MATH_CRC16_SD(uint8_t *buff, uint16_t len);
uint8_t MATH_CRC8_UART(const uint8_t *pcBlock, uint8_t len);
